Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
LSTM_1 (LSTM)                (None, 120, 32)           10624     
_________________________________________________________________
Dropout_1 (Dropout)          (None, 120, 32)           0         
_________________________________________________________________
LSTM_2 (LSTM)                (None, 120, 32)           8320      
_________________________________________________________________
dense (Dense)                (None, 120, 1)            33        
=================================================================
Total params: 18,977
Trainable params: 18,977
Non-trainable params: 0
_________________________________________________________________
